/*=====================================
	■■■ 정렬(Sort) 알고리즘 ■■■
	-- 선택 정렬(Selection Sort)
=======================================*/

/*
 ○ 정렬
	: 데이터를 특정한 규칙(기준)에 맞게 순서대로 나열(오름차순, 내림차순)

 ○ 정렬의 목적
	: 데이터 처리 과정의 편의성이나 가독성을 높이기 위함
	   → 보기좋게...  검색하기 위함

 ○ 정렬의 종류
	: 선택 정렬, 버블 정렬, 삽입 정렬, 힙 정렬, 퀵 정렬, 쉘 정렬 ....
*/

public class Test102
{
	public static void main(String[] args)
	{
		int[] a = {52, 42, 12, 62, 60};
		/*
		52, 42, 12, 62, 60			default
		
		---------------------------------------

		42, 52, 12, 62, 60			0	1
		==	==

		12, 52, 42, 62, 60			0	2
		==	    ==

		12, 52, 42, 62, 60			0	3
		==			==

		12, 52, 42, 62, 60			0	4
		==				==
		---------------------------------------1회전

		12, 42, 52, 62, 60			1	2
			==  ==

		12, 42, 52, 62, 60			1	3
			==		==
		
		12, 42, 52, 62, 60			1	4
			==			==
		---------------------------------------2회전
		12, 42, 52, 62, 60			2	3
				==	==
		
		12, 42, 52, 62, 60			2	4
				==		==
		---------------------------------------3회전
		12, 42, 52, 60, 62			3	4
					==	==
		---------------------------------------4회전
		*/
		
		System.out.print("data : ");
		for (int i : a )
		{
				System.out.print(i+ " ");
		}System.out.println();

		for (int i=0 ; i<a.length; i++)
		{
			for (int j=i+1 ; j<a.length ; j++)
			{
				if (a[i]>a[j])
				{
					a[i] = a[i]^a[j];
					a[j] = a[j]^a[i];
					a[i] = a[i]^a[j];
				}
			}
		}
		

		
		/*
		for ( int i =0 ; i<a.length ; i++)
		{
			System.out.print(a[i]+" ");
		}
		*/
		
		//향상된 for문 → forEach 구문
		//① 순차적으로 접근해서 몽땅 다 꺼낼 대상(타겟) 지정 : a
		//② 타겟을 구성하고있는 타입 지정 : int 
		//③ 타입의 이름은 내가 지을 수 있음 : n
		//for (타입 이름 : 타겟)
		System.out.print("Sort data : ");
		for (int n : a)
		{
			System.out.print(n+ " ");
		}System.out.println();


	}
}