/*========================================
	■■■ 연산자(Operator) ■■■
	- 비트 단위 연산자1
========================================*/

public class Test022
{
	public static void main(String[] args)
	{
		int a = 10, b = -10;
		
		System.out.printf("~a : %d\n", ~a);
		System.out.printf("~b : %d\n", ~b); 


	}
}

/*					비트열반전
a =  10 → 00001010 →→→→→→ 11110101 => -11
		 						    ↓
								    ↓2의 보수 == (1의 보수) + (+1)
								    ↓
								 0001011
					 비트열반전	 
b = -10 → 11110110 →→→→→→ 00001001 (결과) -> 9

	 10 → 00001010
	 		  ↓
			  ↓2의 보수 == (1의 보수) + (+1)
			  ↓
		   11110110

*/

//실행 결과
/*
~a : -11
~b : 9
*/